cask_args appdir: "/Applications"
tap "homebrew/cask"

brew "bash"
brew "cmake"
brew "cscope"
brew "ctags"
brew "gcc" 
brew "htop"
brew "imagemagick"
brew "mosh"
brew "ncurses"
brew "ncdu"
brew "python"
brew "python@2"
brew "ranger"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "w3m"
brew "wget"
brew "zsh"

cask "alfred"
cask "appcleaner"
cask "battle-net"
cask "discord"
cask "balenaetcher"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "mactex"
cask "onyx"
cask "plex-media-player"
cask "steam"
cask "viber"
cask "visual-studio-code"
cask "vmware-fusion"
cask "xquartz"
