brew "bash"
brew "cmake"
brew "cscope"
brew "ctags"
brew "gcc" 
brew "htop"
brew "imagemagick"
brew "mosh"
brew "ncurses"
brew "python"
brew "python@2"
brew "ranger"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "w3m"
brew "wget"
brew "zsh"
